src/cf/DataProcessors/ГенерацияСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ГенерацияСертификатов</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ПараметрыГенерации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СуммаСертификата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСертификатов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/Catalogs/ПодарочныеСертификаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПодарочныеСертификаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магаизны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/ГенерацияСертификатов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура СгенерироватьСертификатыНаСервере()
	Для каждого СтрокаГенерации Из Объект.ПараметрыГенерации Цикл
	
		Для сч=1 По СтрокаГенерации.КоличествоСертификатов Цикл
		
			Сертификат = Справочники.ПодарочныеСертификаты.СоздатьЭлемент();
			Сертификат.Сумма = СтрокаГенерации.СуммаСертификата;
			Сертификат.Магазин = Константы.ТекущийМагазин.Получить();
			Сертификат.УстановитьНовыйКод();
			Сертификат.Записать();
		
		КонецЦикла;
	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьСертификаты(Команда)
	СгенерироватьСертификатыНаСервере();
КонецПроцедуры
